results/cluster-run-logs/chain-engineer-up-fat-profile-20260620-235956.log
[2026-06-20 23:59:56] [chain-engineer-up] sweep root: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956
[2026-06-20 23:59:56] [chain-engineer-up] rps=240 k6=60s settle=15s
[2026-06-20 23:59:56] [chain-engineer-up] === phase 1: fat UP profiling (1 rounds) ===
[2026-06-20 23:59:56] [static-up-sweep] sweep root: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956 profile=up_demo rounds=1
[2026-06-20 23:59:56] [static-up-sweep] baseline deployment=/Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/infra/k8s/spark/robot-shop-web-deployment.baseline.yaml
[2026-06-20 23:59:56] [static-up-sweep] baseline hpa=/Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/infra/k8s/spark/robot-shop-web-hpa.baseline.yaml
[2026-06-20 23:59:56] [static-up-sweep] === round 1/1 rps=240 STRESS_K6_RPS=240 profile=up_demo (static-baseline) ===
[2026-06-20 23:59:56] [cluster-run] kubeconfig: /Users/svastik/Documents/Research/hetzner-svastik-monitoring.yaml
[2026-06-20 23:59:56] [cluster-run] available contexts:
CURRENT   NAME         CLUSTER   AUTHINFO                   NAMESPACE
*         monitoring   spark     svastik-monitoring-admin   monitoring
          svastik      spark     svastik-monitoring-admin   svastik
[2026-06-20 23:59:56] [cluster-run] switching context to: monitoring
[2026-06-20 23:59:56] [cluster-run] context: monitoring
[2026-06-20 23:59:56] [cluster-run] namespace: svastik
[2026-06-20 23:59:56] [cluster-run] profiles: up_demo
[2026-06-20 23:59:56] [cluster-run] log_dir: ./results/cluster-run-logs
[2026-06-20 23:59:56] [cluster-run] analyzer_image: docker.io/svastik/microservices-stress-analyzer:latest
[2026-06-20 23:59:56] [cluster-run] analyzer_image_pull_policy: Always
[2026-06-20 23:59:56] [cluster-run] build_analyzer_image: false
[2026-06-20 23:59:56] [cluster-run] stream_job_logs: true
[2026-06-20 23:59:56] [cluster-run] cleanup_completed_jobs: true
[2026-06-20 23:59:56] [cluster-run] cleanup_terminal_pods: true
[2026-06-20 23:59:56] [cluster-run] cleanup_failed_jobs: true
[2026-06-20 23:59:56] [cluster-run] deploy_analyzer_mongodb: false
[2026-06-20 23:59:57] [cluster-run] up_demo_stabilize_user: true
[2026-06-20 23:59:57] [cluster-run] results_pvc_sync_layout: thin
[2026-06-20 23:59:57] [cluster-run] results_pvc_snapshots: false
[2026-06-20 23:59:57] [cluster-run] results_pvc_copy_comparison_to_root: false
[2026-06-20 23:59:57] [cluster-run] results_stamped_comparison_md: false
[2026-06-20 23:59:57] [cluster-run] compare_sweep_round: 1
[2026-06-20 23:59:57] [cluster-run] extra args for analyzer job: --static-baseline
[2026-06-20 23:59:58] [cluster-run] stack already present; skipping redeploy (set FORCE_DEPLOY_STACK=hard to force helm deploy)
[2026-06-20 23:59:58] [cluster-run] pre-run: restore managed web baseline (prior runs may leave web NotReady / HPA unknown)
[2026-06-20 23:59:58] [cluster-run] apply immutable managed baseline (web deployment + hpa)
NAME                        READY   UP-TO-DATE   AVAILABLE   AGE
deployment.apps/cart        1/1     1            1           59d
deployment.apps/catalogue   1/1     1            1           59d
deployment.apps/dispatch    1/1     1            1           59d
deployment.apps/mongodb     1/1     1            1           59d
deployment.apps/mysql       1/1     1            1           59d
deployment.apps/payment     1/1     1            1           59d
deployment.apps/rabbitmq    1/1     1            1           59d
deployment.apps/ratings     1/1     1            1           59d
deployment.apps/shipping    1/1     1            1           59d
deployment.apps/user        1/1     1            1           59d
deployment.apps/web         5/5     5            5           59d

NAME                       TYPE           CLUSTER-IP      EXTERNAL-IP                           PORT(S)                       AGE
service/analyzer-mongodb   ClusterIP      10.43.64.186    <none>                                27017/TCP                     58d
service/cart               ClusterIP      10.43.156.253   <none>                                8080/TCP                      59d
service/catalogue          ClusterIP      10.43.205.168   <none>                                8080/TCP                      59d
service/dispatch           ClusterIP      None            <none>                                55555/TCP                     59d
service/mongodb            ClusterIP      10.43.54.1      <none>                                27017/TCP                     59d
service/mysql              ClusterIP      10.43.85.29     <none>                                3306/TCP                      59d
service/payment            ClusterIP      10.43.31.102    <none>                                8080/TCP                      59d
service/rabbitmq           ClusterIP      10.43.66.27     <none>                                5672/TCP,15672/TCP,4369/TCP   59d
service/ratings            ClusterIP      10.43.168.84    <none>                                80/TCP                        59d
service/redis              ClusterIP      10.43.165.234   <none>                                6379/TCP                      59d
service/shipping           ClusterIP      10.43.204.81    <none>                                8080/TCP                      59d
service/user               ClusterIP      10.43.191.211   <none>                                8080/TCP                      59d
service/web                LoadBalancer   10.43.14.190    10.0.0.2,10.0.0.3,10.0.0.4,10.0.0.7   8080:32652/TCP                59d

NAME                                          REFERENCE        TARGETS        MINPODS   MAXPODS   REPLICAS   AGE
horizontalpodautoscaler.autoscaling/web-hpa   Deployment/web   cpu: 62%/60%   1         5         5          59d
deployment "web" successfully rolled out
[2026-06-21 00:00:02] [cluster-run] ensure analyzer infra...
[2026-06-21 00:00:04] [cluster-run] skipping analyzer-mongodb deploy (set DEPLOY_ANALYZER_MONGODB=true to enable)
[2026-06-21 00:00:05] [cluster-run] reset baseline in cluster before profile=up_demo
[2026-06-21 00:00:05] [cluster-run] apply immutable managed baseline (web deployment + hpa)
[2026-06-21 00:00:08] [cluster-run] up_demo: raising user service memory/cpu to avoid OOM during recovery demo
[2026-06-21 00:00:11] [cluster-run] launch profile=up_demo job=stress-analyzer-up-demo
[analyzer] context: monitoring
[analyzer] namespace: svastik
[analyzer] job: stress-analyzer-up-demo
[analyzer] profile: up_demo
[analyzer] script: robotshop_login
[analyzer] squeeze: until_violation=false max_iterations=8 settle_seconds=15 compare_optimizers=false compare_hpa_vs_llm=false compare_advanced_vs_vanilla=false static_baseline=true final_report_llm=false
[analyzer] ensuring results pvc...
[analyzer] using image: docker.io/svastik/microservices-stress-analyzer:latest
[analyzer] recreating job...
[analyzer] staging web deployment/hpa via configmap stress-analyzer-web-yaml -> writable /app/run-web-yaml
job.batch/stress-analyzer-up-demo created
[analyzer] launched; follow logs with:
kubectl -n svastik logs -f job/stress-analyzer-up-demo
[2026-06-21 00:00:16] [cluster-run] waiting for stress-analyzer-up-demo (poll every 60s, no overall timeout)
[pipeline] run_start profile=up_demo script=robotshop_login mode=None analysis_goal=efficiency prometheus=True
Error from server (Forbidden): endpoints "web" is forbidden: User "system:serviceaccount:svastik:stress-analyzer" cannot get resource "endpoints" in API group "" in the namespace "svastik"
[measure-ctx] pre_k6 yaml_repl=5 dep_spec=5 ready=5 updated=5 available=5 hpa_cur=5 hpa_des=5 hpa_max=5 pod_count=5 endpoints=0
[measure-ctx] pod name=web-54997bd9b5-4dkf2 phase=Running ready=1/1 ip=10.42.9.226 node=worker4 start=2026-06-21T03:59:49Z
[measure-ctx] pod name=web-54997bd9b5-7hdh8 phase=Running ready=1/1 ip=10.42.7.165 node=worker2 start=2026-06-21T03:59:34Z
[measure-ctx] pod name=web-54997bd9b5-9j5bg phase=Running ready=1/1 ip=10.42.6.34 node=worker1 start=2026-06-21T03:59:51Z
[measure-ctx] pod name=web-54997bd9b5-9wj9t phase=Running ready=1/1 ip=10.42.6.32 node=worker1 start=2026-06-21T03:59:48Z
[measure-ctx] pod name=web-54997bd9b5-whdf7 phase=Running ready=1/1 ip=10.42.0.232 node=master start=2026-06-21T03:52:04Z
failed to create fsnotify watcher: too many open filesfailed to create fsnotify watcher: too many open files[2026-06-21 00:02:20] [cluster-run] stress-analyzer-up-demo completed
[2026-06-21 00:02:22] [cluster-run] saved job logs to ./results/cluster-run-logs/stress-analyzer-up-demo.log
[2026-06-21 00:02:23] [cluster-run] copy results PVC to local /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956 (profile_ok profile=up_demo job=stress-analyzer-up-demo) ...
tar: removing leading '/' from member names
[2026-06-21 00:02:29] [cluster-run] PVC sync done (profile_ok profile=up_demo job=stress-analyzer-up-demo, layout=thin, static): /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1 (pvc=run-1)
[2026-06-21 00:03:01] [cluster-run] cluster-run finished (PVC was synced after each profile job, success or failure)
[2026-06-21 00:03:05] [static-up-sweep] done
[2026-06-21 00:03:05] [chain-engineer-up] === phase 2–3: derive + verify ===
[2026-06-21 00:03:05] [chain-engineer-up] --- rps=240 profile=/Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1/experiment.json ---
engineer baseline: 1×173m/32Mi prov_cost=0.7941 → /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1/engineer-baseline
[2026-06-21 00:03:05] [engineer-verify] baseline dir: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1/engineer-baseline
[2026-06-21 00:03:05] [engineer-verify] deploy: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1/engineer-baseline/engineer-deployment.yaml
[2026-06-21 00:03:05] [engineer-verify] hpa: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1/engineer-baseline/engineer-hpa.yaml
[2026-06-21 00:03:05] [engineer-verify] rps=240 profile=up_demo
[2026-06-21 00:03:05] [engineer-verify] sweep root: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/verify-rps240-20260620-235956
[2026-06-21 00:03:05] [cluster-run] kubeconfig: /Users/svastik/Documents/Research/hetzner-svastik-monitoring.yaml
[2026-06-21 00:03:05] [cluster-run] available contexts:
CURRENT   NAME         CLUSTER   AUTHINFO                   NAMESPACE
*         monitoring   spark     svastik-monitoring-admin   monitoring
          svastik      spark     svastik-monitoring-admin   svastik
[2026-06-21 00:03:05] [cluster-run] switching context to: monitoring
[2026-06-21 00:03:06] [cluster-run] context: monitoring
[2026-06-21 00:03:06] [cluster-run] namespace: svastik
[2026-06-21 00:03:06] [cluster-run] profiles: up_demo
[2026-06-21 00:03:06] [cluster-run] log_dir: ./results/cluster-run-logs
[2026-06-21 00:03:06] [cluster-run] analyzer_image: docker.io/svastik/microservices-stress-analyzer:latest
[2026-06-21 00:03:06] [cluster-run] analyzer_image_pull_policy: Always
[2026-06-21 00:03:06] [cluster-run] build_analyzer_image: false
[2026-06-21 00:03:06] [cluster-run] stream_job_logs: true
[2026-06-21 00:03:06] [cluster-run] cleanup_completed_jobs: true
[2026-06-21 00:03:06] [cluster-run] cleanup_terminal_pods: true
[2026-06-21 00:03:06] [cluster-run] cleanup_failed_jobs: true
[2026-06-21 00:03:06] [cluster-run] deploy_analyzer_mongodb: false
[2026-06-21 00:03:06] [cluster-run] up_demo_stabilize_user: true
[2026-06-21 00:03:06] [cluster-run] results_pvc_sync_layout: thin
[2026-06-21 00:03:06] [cluster-run] results_pvc_snapshots: false
[2026-06-21 00:03:06] [cluster-run] results_pvc_copy_comparison_to_root: false
[2026-06-21 00:03:06] [cluster-run] results_stamped_comparison_md: false
[2026-06-21 00:03:06] [cluster-run] compare_sweep_round: 1
[2026-06-21 00:03:06] [cluster-run] extra args for analyzer job: --static-baseline
[2026-06-21 00:03:08] [cluster-run] stack already present; skipping redeploy (set FORCE_DEPLOY_STACK=hard to force helm deploy)
[2026-06-21 00:03:08] [cluster-run] pre-run: restore managed web baseline (prior runs may leave web NotReady / HPA unknown)
[2026-06-21 00:03:08] [cluster-run] apply immutable managed baseline (web deployment + hpa)
NAME                        READY   UP-TO-DATE   AVAILABLE   AGE
deployment.apps/cart        1/1     1            1           59d
deployment.apps/catalogue   1/1     1            1           59d
deployment.apps/dispatch    1/1     1            1           59d
deployment.apps/mongodb     1/1     1            1           59d
deployment.apps/mysql       1/1     1            1           59d
deployment.apps/payment     1/1     1            1           59d
deployment.apps/rabbitmq    1/1     1            1           59d
deployment.apps/ratings     1/1     1            1           59d
deployment.apps/shipping    1/1     1            1           59d
deployment.apps/user        1/1     1            1           59d
deployment.apps/web         1/1     1            1           59d

NAME                       TYPE           CLUSTER-IP      EXTERNAL-IP                           PORT(S)                       AGE
service/analyzer-mongodb   ClusterIP      10.43.64.186    <none>                                27017/TCP                     58d
service/cart               ClusterIP      10.43.156.253   <none>                                8080/TCP                      59d
service/catalogue          ClusterIP      10.43.205.168   <none>                                8080/TCP                      59d
service/dispatch           ClusterIP      None            <none>                                55555/TCP                     59d
service/mongodb            ClusterIP      10.43.54.1      <none>                                27017/TCP                     59d
service/mysql              ClusterIP      10.43.85.29     <none>                                3306/TCP                      59d
service/payment            ClusterIP      10.43.31.102    <none>                                8080/TCP                      59d
service/rabbitmq           ClusterIP      10.43.66.27     <none>                                5672/TCP,15672/TCP,4369/TCP   59d
service/ratings            ClusterIP      10.43.168.84    <none>                                80/TCP                        59d
service/redis              ClusterIP      10.43.165.234   <none>                                6379/TCP                      59d
service/shipping           ClusterIP      10.43.204.81    <none>                                8080/TCP                      59d
service/user               ClusterIP      10.43.191.211   <none>                                8080/TCP                      59d
service/web                LoadBalancer   10.43.14.190    10.0.0.2,10.0.0.3,10.0.0.4,10.0.0.7   8080:32652/TCP                59d

NAME                                          REFERENCE        TARGETS        MINPODS   MAXPODS   REPLICAS   AGE
horizontalpodautoscaler.autoscaling/web-hpa   Deployment/web   cpu: 51%/60%   1         5         5          59d
deployment "web" successfully rolled out
[2026-06-21 00:03:14] [cluster-run] ensure analyzer infra...
[2026-06-21 00:03:16] [cluster-run] skipping analyzer-mongodb deploy (set DEPLOY_ANALYZER_MONGODB=true to enable)
[2026-06-21 00:03:18] [cluster-run] reset baseline in cluster before profile=up_demo
[2026-06-21 00:03:18] [cluster-run] apply immutable managed baseline (web deployment + hpa)
[2026-06-21 00:03:20] [cluster-run] up_demo: raising user service memory/cpu to avoid OOM during recovery demo
[2026-06-21 00:03:22] [cluster-run] launch profile=up_demo job=stress-analyzer-up-demo
[analyzer] context: monitoring
[analyzer] namespace: svastik
[analyzer] job: stress-analyzer-up-demo
[analyzer] profile: up_demo
[analyzer] script: robotshop_login
[analyzer] squeeze: until_violation=false max_iterations=8 settle_seconds=15 compare_optimizers=false compare_hpa_vs_llm=false compare_advanced_vs_vanilla=false static_baseline=true final_report_llm=false
[analyzer] ensuring results pvc...
[analyzer] using image: docker.io/svastik/microservices-stress-analyzer:latest
[analyzer] recreating job...
[analyzer] staging web deployment/hpa via configmap stress-analyzer-web-yaml -> writable /app/run-web-yaml
job.batch/stress-analyzer-up-demo created
[analyzer] launched; follow logs with:
kubectl -n svastik logs -f job/stress-analyzer-up-demo
[2026-06-21 00:03:27] [cluster-run] waiting for stress-analyzer-up-demo (poll every 60s, no overall timeout)
[pipeline] run_start profile=up_demo script=robotshop_login mode=None analysis_goal=efficiency prometheus=True
Error from server (Forbidden): endpoints "web" is forbidden: User "system:serviceaccount:svastik:stress-analyzer" cannot get resource "endpoints" in API group "" in the namespace "svastik"
[measure-ctx] pre_k6 yaml_repl=1 dep_spec=1 ready=1 updated=1 available=1 hpa_cur=1 hpa_des=5 hpa_max=5 pod_count=1 endpoints=0
[measure-ctx] pod name=web-645d4c6f87-c6dgx phase=Running ready=1/1 ip=10.42.7.166 node=worker2 start=2026-06-21T04:03:03Z

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /app/benchmarks/load-tests/k6/robotshop_login.js
        output: -

     scenarios: (100.00%) 1 scenario, 440 max VUs, 1m30s max duration (incl. graceful stop):
              * constant_rate: 240.00 iterations/s for 1m0s (maxVUs: 360-440, gracefulStop: 30s)


running (0m00.6s), 031/360 VUs, 112 complete and 0 interrupted iterations
constant_rate   [   1% ] 031/360 VUs  0m00.6s/1m0s  240.00 iters/s

running (0m01.6s), 068/360 VUs, 315 complete and 0 interrupted iterations
constant_rate   [   3% ] 068/360 VUs  0m01.6s/1m0s  240.00 iters/s

running (0m02.6s), 070/360 VUs, 553 complete and 0 interrupted iterations
constant_rate   [   4% ] 070/360 VUs  0m02.6s/1m0s  240.00 iters/s

running (0m03.6s), 025/360 VUs, 838 complete and 0 interrupted iterations
constant_rate   [   6% ] 025/360 VUs  0m03.6s/1m0s  240.00 iters/s

running (0m04.6s), 042/360 VUs, 1061 complete and 0 interrupted iterations
constant_rate   [   8% ] 042/360 VUs  0m04.6s/1m0s  240.00 iters/s

running (0m05.6s), 028/360 VUs, 1315 complete and 0 interrupted iterations
constant_rate   [   9% ] 028/360 VUs  0m05.6s/1m0s  240.00 iters/s

running (0m06.6s), 041/360 VUs, 1542 complete and 0 interrupted iterations
constant_rate   [  11% ] 041/360 VUs  0m06.6s/1m0s  240.00 iters/s

running (0m07.6s), 036/360 VUs, 1787 complete and 0 interrupted iterations
constant_rate   [  13% ] 036/360 VUs  0m07.6s/1m0s  240.00 iters/s

running (0m08.6s), 081/360 VUs, 1982 complete and 0 interrupted iterations
constant_rate   [  14% ] 081/360 VUs  0m08.6s/1m0s  240.00 iters/s

running (0m09.6s), 029/360 VUs, 2274 complete and 0 interrupted iterations
constant_rate   [  16% ] 029/360 VUs  0m09.6s/1m0s  240.00 iters/s

running (0m10.6s), 030/360 VUs, 2513 complete and 0 interrupted iterations
constant_rate   [  18% ] 030/360 VUs  0m10.6s/1m0s  240.00 iters/s

running (0m11.6s), 026/360 VUs, 2757 complete and 0 interrupted iterations
constant_rate   [  19% ] 026/360 VUs  0m11.6s/1m0s  240.00 iters/s

running (0m12.6s), 031/360 VUs, 2992 complete and 0 interrupted iterations
constant_rate   [  21% ] 031/360 VUs  0m12.6s/1m0s  240.00 iters/s

running (0m13.6s), 057/360 VUs, 3206 complete and 0 interrupted iterations
constant_rate   [  23% ] 057/360 VUs  0m13.6s/1m0s  240.00 iters/s

running (0m14.6s), 032/360 VUs, 3471 complete and 0 interrupted iterations
constant_rate   [  24% ] 032/360 VUs  0m14.6s/1m0s  240.00 iters/s

running (0m15.6s), 085/360 VUs, 3658 complete and 0 interrupted iterations
constant_rate   [  26% ] 085/360 VUs  0m15.6s/1m0s  240.00 iters/s

running (0m16.6s), 025/360 VUs, 3958 complete and 0 interrupted iterations
constant_rate   [  28% ] 025/360 VUs  0m16.6s/1m0s  240.00 iters/s

running (0m17.6s), 028/360 VUs, 4195 complete and 0 interrupted iterations
constant_rate   [  29% ] 028/360 VUs  0m17.6s/1m0s  240.00 iters/s

running (0m18.6s), 030/360 VUs, 4433 complete and 0 interrupted iterations
constant_rate   [  31% ] 030/360 VUs  0m18.6s/1m0s  240.00 iters/s

running (0m19.6s), 046/360 VUs, 4657 complete and 0 interrupted iterations
constant_rate   [  33% ] 046/360 VUs  0m19.6s/1m0s  240.00 iters/s

running (0m20.6s), 086/360 VUs, 4857 complete and 0 interrupted iterations
constant_rate   [  34% ] 086/360 VUs  0m20.6s/1m0s  240.00 iters/s

running (0m21.6s), 059/360 VUs, 5124 complete and 0 interrupted iterations
constant_rate   [  36% ] 059/360 VUs  0m21.6s/1m0s  240.00 iters/s

running (0m22.6s), 093/360 VUs, 5330 complete and 0 interrupted iterations
constant_rate   [  38% ] 093/360 VUs  0m22.6s/1m0s  240.00 iters/s

running (0m23.6s), 030/360 VUs, 5633 complete and 0 interrupted iterations
constant_rate   [  39% ] 030/360 VUs  0m23.6s/1m0s  240.00 iters/s

running (0m24.6s), 025/360 VUs, 5878 complete and 0 interrupted iterations
constant_rate   [  41% ] 025/360 VUs  0m24.6s/1m0s  240.00 iters/s

running (0m25.6s), 062/360 VUs, 6081 complete and 0 interrupted iterations
constant_rate   [  43% ] 062/360 VUs  0m25.6s/1m0s  240.00 iters/s

running (0m26.6s), 063/360 VUs, 6320 complete and 0 interrupted iterations
constant_rate   [  44% ] 063/360 VUs  0m26.6s/1m0s  240.00 iters/s

running (0m27.6s), 119/360 VUs, 6504 complete and 0 interrupted iterations
constant_rate   [  46% ] 119/360 VUs  0m27.6s/1m0s  240.00 iters/s

running (0m28.6s), 060/360 VUs, 6803 complete and 0 interrupted iterations
constant_rate   [  48% ] 060/360 VUs  0m28.6s/1m0s  240.00 iters/s

running (0m29.6s), 085/360 VUs, 7018 complete and 0 interrupted iterations
constant_rate   [  49% ] 085/360 VUs  0m29.6s/1m0s  240.00 iters/s

running (0m30.6s), 037/360 VUs, 7306 complete and 0 interrupted iterations
constant_rate   [  51% ] 037/360 VUs  0m30.6s/1m0s  240.00 iters/s

running (0m31.6s), 025/360 VUs, 7558 complete and 0 interrupted iterations
constant_rate   [  53% ] 025/360 VUs  0m31.6s/1m0s  240.00 iters/s

running (0m32.6s), 027/360 VUs, 7796 complete and 0 interrupted iterations
constant_rate   [  54% ] 027/360 VUs  0m32.6s/1m0s  240.00 iters/s

running (0m33.6s), 032/360 VUs, 8031 complete and 0 interrupted iterations
constant_rate   [  56% ] 032/360 VUs  0m33.6s/1m0s  240.00 iters/s

running (0m34.6s), 088/360 VUs, 8215 complete and 0 interrupted iterations
constant_rate   [  58% ] 088/360 VUs  0m34.6s/1m0s  240.00 iters/s

running (0m35.6s), 084/360 VUs, 8459 complete and 0 interrupted iterations
constant_rate   [  59% ] 084/360 VUs  0m35.6s/1m0s  240.00 iters/s

running (0m36.6s), 084/360 VUs, 8699 complete and 0 interrupted iterations
constant_rate   [  61% ] 084/360 VUs  0m36.6s/1m0s  240.00 iters/s

running (0m37.6s), 032/360 VUs, 8991 complete and 0 interrupted iterations
constant_rate   [  63% ] 032/360 VUs  0m37.6s/1m0s  240.00 iters/s

running (0m38.6s), 026/360 VUs, 9237 complete and 0 interrupted iterations
constant_rate   [  64% ] 026/360 VUs  0m38.6s/1m0s  240.00 iters/s

running (0m39.6s), 025/360 VUs, 9478 complete and 0 interrupted iterations
constant_rate   [  66% ] 025/360 VUs  0m39.6s/1m0s  240.00 iters/s

running (0m40.6s), 026/360 VUs, 9717 complete and 0 interrupted iterations
constant_rate   [  68% ] 026/360 VUs  0m40.6s/1m0s  240.00 iters/s

running (0m41.6s), 037/360 VUs, 9946 complete and 0 interrupted iterations
constant_rate   [  69% ] 037/360 VUs  0m41.6s/1m0s  240.00 iters/s

running (0m42.6s), 029/360 VUs, 10194 complete and 0 interrupted iterations
constant_rate   [  71% ] 029/360 VUs  0m42.6s/1m0s  240.00 iters/s

running (0m43.6s), 085/360 VUs, 10378 complete and 0 interrupted iterations
constant_rate   [  73% ] 085/360 VUs  0m43.6s/1m0s  240.00 iters/s

running (0m44.6s), 039/360 VUs, 10664 complete and 0 interrupted iterations
constant_rate   [  74% ] 039/360 VUs  0m44.6s/1m0s  240.00 iters/s

running (0m45.6s), 025/360 VUs, 10918 complete and 0 interrupted iterations
constant_rate   [  76% ] 025/360 VUs  0m45.6s/1m0s  240.00 iters/s

running (0m46.6s), 028/360 VUs, 11155 complete and 0 interrupted iterations
constant_rate   [  78% ] 028/360 VUs  0m46.6s/1m0s  240.00 iters/s

running (0m47.6s), 025/360 VUs, 11398 complete and 0 interrupted iterations
constant_rate   [  79% ] 025/360 VUs  0m47.6s/1m0s  240.00 iters/s

running (0m48.6s), 082/360 VUs, 11581 complete and 0 interrupted iterations
constant_rate   [  81% ] 082/360 VUs  0m48.6s/1m0s  240.00 iters/s

running (0m49.6s), 045/360 VUs, 11858 complete and 0 interrupted iterations
constant_rate   [  83% ] 045/360 VUs  0m49.6s/1m0s  240.00 iters/s

running (0m50.6s), 102/360 VUs, 12040 complete and 0 interrupted iterations
constant_rate   [  84% ] 102/360 VUs  0m50.6s/1m0s  240.00 iters/s

running (0m51.6s), 123/360 VUs, 12260 complete and 0 interrupted iterations
constant_rate   [  86% ] 123/360 VUs  0m51.6s/1m0s  240.00 iters/s

running (0m52.6s), 155/360 VUs, 12468 complete and 0 interrupted iterations
constant_rate   [  88% ] 155/360 VUs  0m52.6s/1m0s  240.00 iters/s

running (0m53.6s), 157/360 VUs, 12706 complete and 0 interrupted iterations
constant_rate   [  89% ] 157/360 VUs  0m53.6s/1m0s  240.00 iters/s

running (0m54.6s), 150/360 VUs, 12953 complete and 0 interrupted iterations
constant_rate   [  91% ] 150/360 VUs  0m54.6s/1m0s  240.00 iters/s

running (0m55.6s), 092/360 VUs, 13251 complete and 0 interrupted iterations
constant_rate   [  93% ] 092/360 VUs  0m55.6s/1m0s  240.00 iters/s

running (0m56.6s), 083/360 VUs, 13500 complete and 0 interrupted iterations
constant_rate   [  94% ] 083/360 VUs  0m56.6s/1m0s  240.00 iters/s

running (0m57.6s), 060/360 VUs, 13763 complete and 0 interrupted iterations
constant_rate   [  96% ] 060/360 VUs  0m57.6s/1m0s  240.00 iters/s

running (0m58.6s), 084/360 VUs, 13979 complete and 0 interrupted iterations
constant_rate   [  98% ] 084/360 VUs  0m58.6s/1m0s  240.00 iters/s

running (0m59.6s), 036/360 VUs, 14267 complete and 0 interrupted iterations
constant_rate   [  99% ] 036/360 VUs  0m59.6s/1m0s  240.00 iters/s

     ✓ status is 200
     ✓ has user name

     checks.........................: 100.00% 28800 out of 28800
     data_received..................: 6.1 MB  102 kB/s
     data_sent......................: 3.4 MB  56 kB/s
     http_req_blocked...............: avg=30.29µs  min=3.42µs   med=6.58µs   max=15.56ms  p(90)=10.01µs  p(95)=15.25µs 
     http_req_connecting............: avg=20.36µs  min=0s       med=0s       max=15.48ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=129.25ms min=1.99ms   med=81.77ms  max=798.68ms p(90)=326.54ms p(95)=452.99ms
       { expected_response:true }...: avg=129.25ms min=1.99ms   med=81.77ms  max=798.68ms p(90)=326.54ms p(95)=452.99ms
   ✓ http_req_failed................: 0.00%   0 out of 14400
     http_req_receiving.............: avg=66.56µs  min=17.4µs   med=56.73µs  max=1.81ms   p(90)=103.18µs p(95)=123.93µs
     http_req_sending...............: avg=35.33µs  min=10.37µs  med=31.75µs  max=1.02ms   p(90)=51.16µs  p(95)=61.82µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=129.15ms min=1.92ms   med=81.64ms  max=798.58ms p(90)=326.47ms p(95)=452.88ms
     http_reqs......................: 14400   239.421142/s
     iteration_duration.............: avg=230.06ms min=102.39ms med=182.54ms max=898.95ms p(90)=427ms    p(95)=553.57ms
     iterations.....................: 14400   239.421142/s
     vus............................: 36      min=25             max=157
     vus_max........................: 360     min=360            max=360


running (1m00.1s), 000/360 VUs, 14400 complete and 0 interrupted iterations
constant_rate ✓ [ 100% ] 000/360 VUs  1m0s  240.00 iters/s
[pipeline] k6_done exit=0 http_req_failed=0 checks=1 p95_ms=452.99365434999993 http_reqs=14400
[pipeline] analysis_start
[analysis] run_analysis_start run_dir=/app/results/engineer-derived-verify/run-1 deployment_yaml=/app/run-web-yaml/robot-shop-web-deployment.yaml hpa_yaml=/app/run-web-yaml/robot-shop-web-hpa.yaml shared_canonical=False
[analysis] prometheus_collect_start namespace=svastik deployment=web url=http://my-kube-prometheus-stack-prometheus.monitoring.svc:9090
[prom] collect_start namespace=svastik deployment=web window=(1782014619.211,1782014680.004) step=5s
[prom] collect_warn prom_pod_count=5 yaml_replicas=2 prom_replicas_mean=1.92 MISMATCH
[prom] collect_done cpu_util_request_pct=93.5 burn_m=323.4 cpu_util_request_pct_peak=81.4 mem_util_pct=18.9 cpu_series_matched=True mem_series_matched=True cpu_attempts=1 mem_attempts=1 cpu_mode=per_pod_series_sum mem_mode=per_pod_series_sum cpu_query_used='rate(container_cpu_usage_seconds_total{namespace="svastik",pod=~"web-.+",container!="",container!="POD"}[1m])' samples=13/12 step=5s rate=1m per_pod_sum_m=323.4 aggregate_delta_m=0.0 trustworthy=True
[prom] collect_per_pod pod=web-645d4c6f87-c6dgx container=web mean_m=154.2 peak_m=217.0 samples=13
[prom] collect_per_pod pod=web-54997bd9b5-4dkf2 container=web mean_m=44.6 peak_m=64.8 samples=5
[prom] collect_per_pod pod=web-54997bd9b5-9j5bg container=web mean_m=42.4 peak_m=51.6 samples=5
[prom] collect_per_pod pod=web-54997bd9b5-7hdh8 container=web mean_m=41.7 peak_m=41.7 samples=1
[prom] collect_per_pod pod=web-54997bd9b5-9wj9t container=web mean_m=40.5 peak_m=47.5 samples=4
[analysis] prometheus_collect_done burn_m=323.4 cpu_pct_req=93.5 prom_pods=5 repl_mismatch=True cpu_util_pct=46.7 mem_util_pct=18.9 cpu_series_matched=True mem_series_matched=True utilization_trustworthy=True
[analysis] experiment_written scaling_hint=DOWN failure_reason=
[analysis] yaml_live_sync sync.deployment_replicas: 1 -> 3 (observed)
[analysis] formula_optimizer_step mode=squeeze analysis_goal=efficiency scaling_hint=DOWN
[analysis] formula_optimizer_done failure_archetype=NONE has_deployment_yaml_new=False has_hpa_yaml_new=False
[analysis] outputs_written run_dir=/app/results/engineer-derived-verify/run-1 diff_nonempty=False report_chars=261
Run output: /app/results/engineer-derived-verify/run-1
  k6-run-summary.json, experiment.json, analysis.json, report.md, recommended.diff
  Failure archetype: NONE
[pipeline] analysis_done run_dir=/app/results/engineer-derived-verify/run-1
[pipeline] experiment_status=PASS failure_reason= burn_m=323.4 cpu_pct_req=93.5 repl=3 prom_pods=5 repl_mismatch=True cpu_util_pct=46.7 mem_util_pct=18.9 utilization_trustworthy=True per_pod=['web-645d4c6f87-c6dgx:154.2', 'web-54997bd9b5-4dkf2:44.6', 'web-54997bd9b5-9j5bg:42.4', 'web-54997bd9b5-7hdh8:41.7', 'web-54997bd9b5-9wj9t:40.5']
[2026-06-21 00:05:31] [cluster-run] stress-analyzer-up-demo completed
[2026-06-21 00:05:33] [cluster-run] saved job logs to ./results/cluster-run-logs/stress-analyzer-up-demo.log
[2026-06-21 00:05:34] [cluster-run] copy results PVC to local /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/verify-rps240-20260620-235956 (profile_ok profile=up_demo job=stress-analyzer-up-demo) ...
tar: removing leading '/' from member names
[2026-06-21 00:05:40] [cluster-run] PVC sync done (profile_ok profile=up_demo job=stress-analyzer-up-demo, layout=thin, static): /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/verify-rps240-20260620-235956/run-1 (pvc=run-1)
[2026-06-21 00:06:11] [cluster-run] cluster-run finished (PVC was synced after each profile job, success or failure)
verify PASS: 1×173m/32Mi measured_prov_cost=0.4765 derived_prov_cost=0.7941
[2026-06-21 00:06:13] [engineer-verify] verify-run synced → /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956/run-1/engineer-baseline/verify-run
[2026-06-21 00:06:13] [engineer-verify] next: ./scripts/build_engineer_vs_advanced_comparisons.sh
[2026-06-21 00:06:13] [chain-engineer-up] synced engineer-baseline → /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts_latest/FORMULA_VS_ADVANCED_LLM/UP/GOOD_COST_WIN_run-1-rps240-20260609-192356/llm-run/engineer-baseline
[2026-06-21 00:06:13] [chain-engineer-up] === phase 4: compare + archive ===
[engineer-vs-advanced] artifact roots: vanilla + formula (advanced-llm-run / llm-run)
[engineer-vs-advanced] engineer UP sweep: /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/static-up-sweep-20260527-125059
[engineer-vs-advanced] engineer DOWN sweep: <not set>
wrote /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM/UP/run-rps220/comparison.md ( verified: Autopilot-derived YAML + cluster k6 , advanced= llm-run )
wrote /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM/UP/run-rps240/comparison.md ( verified: Autopilot-derived YAML + cluster k6 , advanced= llm-run )
wrote /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM/UP/run-rps260/comparison.md ( verified: Autopilot-derived YAML + cluster k6 , advanced= advanced-llm-run )
wrote /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM/DOWN/run-rps25/comparison.md ( verified: Autopilot-derived YAML + cluster k6 , advanced= advanced-llm-run )
[engineer-vs-advanced] SKIP DOWN rps=35: no engineer experiment
wrote /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM/DOWN/run-rps45/comparison.md ( verified: Autopilot-derived YAML + cluster k6 , advanced= advanced-llm-run )
wrote /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM/DOWN/run-rps55/comparison.md ( verified: Autopilot-derived YAML + cluster k6 , advanced= llm-run )
[engineer-vs-advanced] done -> /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts/ENGINEER_VS_ADVANCED_LLM
[2026-06-21 00:06:14] [chain-engineer-up] archiving UP rps=240
archived → /Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts_latest/ENGINEER_VS_ADVANCED_LLM/UP/GOOD_COST_WIN_run-1-rps240-20260621-040440
[2026-06-21 00:06:15] [chain-engineer-up] done sweep=/Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/results-from-cluster/engineer-up-fat-profile-20260620-235956 archive=/Users/svastik/Documents/Svastik/github/microservices-stress-test-llm-analysis/artifacts_latest/ENGINEER_VS_ADVANCED_LLM/UP/